consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp_p.c
    if (OSRunning > 0u) {                                       /*Check if multi-tasking has started.                   */
        BSP_Tick_Init();
    }

    return (HAL_OK);
}


/*
*********************************************************************************************************
*                                            BSP_Tick_Init()
*
* Description : Initialize all the peripherals that required OS Tick services (OS initialized)
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/
void BSP_Tick_Init (void)
{
    CPU_INT32U  cpu_clk_freq;
    CPU_INT32U  cnts;

    cpu_clk_freq = BSP_CPU_ClkFreq();                           /* Determine SysTick reference freq.                    */

#if (OS_VERSION >= 30000u)
    cnts  = cpu_clk_freq / (CPU_INT32U)OSCfg_TickRate_Hz;       /* Determine nbr SysTick increments.                    */
#else
    cnts  = cpu_clk_freq / (CPU_INT32U)OS_TICKS_PER_SEC;        /* Determine nbr SysTick increments.                    */
#endif

    OS_CPU_SysTickInit(cnts);                                   /* Init uC/OS periodic time src (SysTick).              */
}


/*
*********************************************************************************************************
*                                           BSP_LED_Init()
*
* Description : Initialize any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    inialize ALL  LEDs
*                       1    inialize user LED1
*                       2    inialize user LED2
*                       3    inialize user LED3
*                       4    inialize user LED4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

static void  BSP_LED_Init()
{
    GPIO_InitTypeDef  gpio_init;


    BSP_PeriphEn(BSP_PERIPH_ID_GPIOD);                          /* Configure GPIOD for LED1, LED2, LED3 and LED4       */

    gpio_init.Pin   = BSP_GPIOD_LED1 | BSP_GPIOD_LED2 | BSP_GPIOD_LED3 | BSP_GPIOD_LED4;
    gpio_init.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio_init.Pull  = GPIO_PULLUP;
    gpio_init.Speed = GPIO_SPEED_HIGH;

    HAL_GPIO_Init(GPIOD, &gpio_init);
}


/*
*********************************************************************************************************
*                                           BSP_SEGMENT_Init()
*
* Description : Initialize any or all the LEDs on the board.
*
* Argument(s) : com     The ID of the common to control:
*
*                       1    inialize user COM1
*                       2    inialize user COM2
*                       3    inialize user COM3
*                       4    inialize user COM4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

static void  BSP_SEGMENT_Init()
{
  
//#define  BSP_GPIOC_SEGMENTA                     DEF_BIT_13
//#define  BSP_GPIOC_SEGMENTB                     DEF_BIT_11
//#define  BSP_GPIOE_SEGMENTC                     DEF_BIT_07
//#define  BSP_GPIOA_SEGMENTD                     DEF_BIT_05
//#define  BSP_GPIOA_SEGMENTE                     DEF_BIT_01
//#define  BSP_GPIOD_SEGMENTF                     DEF_BIT_06
//#define  BSP_GPIOE_SEGMENTG                     DEF_BIT_13
//#define  BSP_GPIOC_SEGMENTH                     DEF_BIT_05
//#define  BSP_GPIOC_SEGCOM1                      DEF_BIT_15
//#define  BSP_GPIOD_SEGCOM2                      DEF_BIT_04
//#define  BSP_GPIOD_SEGCOM3                      DEF_BIT_02
//#define  BSP_GPIOE_SEGCOM4                      DEF_BIT_15
  
    GPIO_InitTypeDef  gpio_init;

    /* Configure GPIOA                                      */
    BSP_PeriphEn(BSP_PERIPH_ID_GPIOA);  
    
//    gpio_init.Pin   = ; 
    gpio_init.Pin   = BSP_GPIOA_SEGMENTD | BSP_GPIOA_SEGMENTE;
    gpio_init.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio_init.Pull  = GPIO_PULLUP;
    gpio_init.Speed = GPIO_SPEED_HIGH;

    HAL_GPIO_Init(GPIOA, &gpio_init);
    
    /* Configure GPIOC                                       */
    BSP_PeriphEn(BSP_PERIPH_ID_GPIOC);                          

    gpio_init.Pin   = BSP_GPIOC_SEGMENTA | BSP_GPIOC_SEGMENTB | BSP_GPIOC_SEGMENTH | BSP_GPIOC_SEGCOM1;
    
    HAL_GPIO_Init(GPIOC, &gpio_init);

    /* Configure GPIOD                                       */
    BSP_PeriphEn(BSP_PERIPH_ID_GPIOD);                          

    gpio_init.Pin   = BSP_GPIOD_SEGMENTF | BSP_GPIOD_SEGCOM2 | BSP_GPIOD_SEGCOM3;
    
    HAL_GPIO_Init(GPIOD, &gpio_init);
    
    /* Configure GPIOE                                       */
    BSP_PeriphEn(BSP_PERIPH_ID_GPIOE);                          

//    gpio_init.Pin   = ;
    gpio_init.Pin   = BSP_GPIOE_SEGMENTC | BSP_GPIOE_SEGMENTG | BSP_GPIOE_SEGCOM4;
    
    HAL_GPIO_Init(GPIOE, &gpio_init);    
}


/*
*********************************************************************************************************
*                                             BSP_LED_On()
*
* Description : Turn ON any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    turns ON ALL  LEDs
*                       1    turns ON user LED1
*                       2    turns ON user LED2
*                       3    turns ON user LED3
*                       4    turns ON user LED4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_LED_On (CPU_INT08U  led)
{
    switch (led) {
        case 0u:
             HAL_GPIO_WritePin(GPIOD, (BSP_GPIOD_LED1 | BSP_GPIOD_LED2 | BSP_GPIOD_LED3 | BSP_GPIOD_LED4), GPIO_PIN_SET);
             break;


        case 1u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED1, GPIO_PIN_SET);
             break;


        case 2u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED2, GPIO_PIN_SET);
             break;


