consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp_p.c
        case 3u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED3, GPIO_PIN_SET);
             break;


        case 4u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED4, GPIO_PIN_SET);
             break;


        default:
             break;
    }
}


/*
*********************************************************************************************************
*                                              BSP_LED_Off()
*
* Description : Turn OFF any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    turns OFF ALL the LEDs
*                       1    turns OFF user LED1
*                       2    turns OFF user LED2
*                       3    turns OFF user LED3
*                       4    turns OFF user LED4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_LED_Off (CPU_INT08U led)
{
    switch (led) {
        case 0u:
             HAL_GPIO_WritePin(GPIOD, (BSP_GPIOD_LED1 | BSP_GPIOD_LED2 | BSP_GPIOD_LED3 | BSP_GPIOD_LED3), GPIO_PIN_RESET);
//             HAL_GPIO_WritePin(GPIOI, BSP_GPIOI_LED3, GPIO_PIN_RESET);
//             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_LED4, GPIO_PIN_RESET);
             break;


        case 1u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED1, GPIO_PIN_RESET);
             break;


        case 2u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED2, GPIO_PIN_RESET);
             break;


        case 3u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED3, GPIO_PIN_RESET);
             break;


        case 4u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED4, GPIO_PIN_RESET);
             break;


        default:
             break;
    }
}


/*
*********************************************************************************************************
*                                            BSP_LED_Toggle()
*
* Description : TOGGLE any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    TOGGLE ALL the LEDs
*                       1    TOGGLE user LED1
*                       2    TOGGLE user LED2
*                       3    TOGGLE user LED3
*                       4    TOGGLE user LED4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_LED_Toggle (CPU_INT08U  led)
{
    switch (led) {
        case 0u:
             HAL_GPIO_TogglePin(GPIOD,(BSP_GPIOD_LED1 | BSP_GPIOD_LED2 | BSP_GPIOD_LED3 | BSP_GPIOD_LED4));
             break;


        case 1u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED1);
             break;


        case 2u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED2);
             break;


        case 3u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED3);
             break;


        case 4u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED4);
             break;


        default:
             break;
    }
}

/*
*********************************************************************************************************
*                                             BSP_LED_On()
*
* Description : Turn ON any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    turns ON ALL  LEDs
*                       1    turns ON user LED1
*                       2    turns ON user LED2
*                       3    turns ON user LED3
*                       4    turns ON user LED4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_SEGMENT_On (CPU_INT08U  com, CPU_INT08U  seg)
{
    CPU_INT08U seg_0, seg_a, seg_b, seg_c, seg_d, seg_e, seg_f, seg_g, seg_h;
  
    seg_0 = seg;
  
    if (seg_0 >= 128u) { seg_0 = seg_0 - 128u; seg_a = 1u; }
    if (seg_0 >= 64u) { seg_0 = seg_0 - 64u; seg_b = 1u; }
    if (seg_0 >= 32u) { seg_0 = seg_0 - 32u; seg_c = 1u; }
    if (seg_0 >= 16u) { seg_0 = seg_0 - 16u; seg_d = 1u; }
    if (seg_0 >= 8u) { seg_0 = seg_0 - 8u; seg_e = 1u; }
    if (seg_0 >= 4u) { seg_0 = seg_0 - 4u; seg_f = 1u; }
    if (seg_0 >= 2u) { seg_0 = seg_0 - 2u; seg_g = 1u; }
    if (seg_0 >= 1u) { seg_0 = seg_0 - 1u; seg_h = 1u; }
    
    switch (com) {
        case 1u:
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_SET);
             if (seg_a == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_SET); }
             if (seg_b == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_SET); }
             if (seg_c == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_SET); }
             if (seg_d == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_SET); }
             if (seg_e == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_SET); }
             if (seg_f == 1u) { HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_SET); }
             if (seg_g == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_SET); }
             if (seg_h == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_SET); }
             break;
        case 2u:
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_SET);
             if (seg_a == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_SET); }
             if (seg_b == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_SET); }
             if (seg_c == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_SET); }
             if (seg_d == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_SET); }
             if (seg_e == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_SET); }
             if (seg_f == 1u) { HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_SET); }
             if (seg_g == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_SET); }
             if (seg_h == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_SET); }
             break;

