consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp_p.c
        case 3u:
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_SET);
             if (seg_a == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_SET); }
             if (seg_b == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_SET); }
             if (seg_c == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_SET); }
             if (seg_d == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_SET); }
             if (seg_e == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_SET); }
             if (seg_f == 1u) { HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_SET); }
             if (seg_g == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_SET); }
             if (seg_h == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_SET); }
             break;

        case 4u:
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_RESET);
             if (seg_a == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_SET); }
             if (seg_b == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_SET); }
             if (seg_c == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_SET); }
             if (seg_d == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_SET); }
             if (seg_e == 1u) { HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_SET); }
             if (seg_f == 1u) { HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_SET); }
             if (seg_g == 1u) { HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_SET); }
             if (seg_h == 1u) { HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_SET); }
             break;

        default:
             break;
    }
}


/*
*********************************************************************************************************
*                                              BSP_LED_Off()
*
* Description : Turn OFF any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    turns OFF ALL the LEDs
*                       1    turns OFF user LED1
*                       2    turns OFF user LED2
*                       3    turns OFF user LED3
*                       4    turns OFF user LED4
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_SEGMENT_Off (CPU_INT08U  com)
{
    switch (com) {

        case 1u:
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_RESET);
             break;


        case 2u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_RESET);
             break;


        case 3u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_RESET);
             break;


        case 4u:
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_SET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_RESET);
             HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_RESET);
             break;


        default:
             break;
    }
}
